recipes/sweet-potato-chickpea-buddha-bowl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sweet Potato Chickpea Buddha Bowl</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Sweet Potato Chickpea Buddha Bowl</h1>
<p>
<a href="https://minimalistbaker.com/sweet-potato-chickpea-buddha-bowl/">Original link</a>
</p>

<div id="outline-container-org988f444" class="outline-2">
<h2 id="org988f444">Ingredients</h2>
<div class="outline-text-2" id="text-org988f444">
<ul class="org-ul">
<li>2 Tbsp olive, melted coconut, or grape seed oil</li>
<li>1/2 red onion, sliced in wedges</li>
<li>2 large sweet potatoes, halved</li>
<li>1 bundle (227 g) broccolini, large stems removed, chopped</li>
<li>2 big handfuls kale, larger stems removed</li>
<li>1/4 tsp each salt + pepper</li>
</ul>
</div>

<div id="outline-container-org3f3c0d0" class="outline-3">
<h3 id="org3f3c0d0">Chickpeas</h3>
<div class="outline-text-3" id="text-org3f3c0d0">
<ul class="org-ul">
<li>1 can (400 g) chickpeas, drained, rinsed + patted dry</li>
<li>1 tsp cumin</li>
<li>3/4 tsp chili powder</li>
<li>3/4 tsp garlic powder</li>
<li>1/4 tsp each salt + pepper</li>
<li>1/2 tsp oregano (optional)</li>
<li>2/4 tsp turmeric (optional)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc4b799" class="outline-3">
<h3 id="orgdc4b799">Tahini sauce (optional)</h3>
<div class="outline-text-3" id="text-orgdc4b799">
<ul class="org-ul">
<li>1/4 cup (56 g) tahini</li>
<li>1 Tbsp maple syrup</li>
<li>1/2 lemon, juiced</li>
<li>2-4 Tbsp hot water to thin</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbc96a4b" class="outline-2">
<h2 id="orgbc96a4b">Method</h2>
<div class="outline-text-2" id="text-orgbc96a4b">
<ol class="org-ol">
<li>Preheat oven to 200&deg;C and arrange sweet potatoes and onions on a bare baking sheet. Drizzle both with a bit of oil, making sure the flesh of the sweet potatoes are well coated and placed skin side down on the sheet.</li>
<li>Bake for 10 minutes, then remove from oven flip sweet potatoes and add broccolini. Drizzle broccolini with a bit of oil and season with a pinch each salt and pepper.</li>
<li>Bake for another 8-10 minutes, then remove from oven and add kale. Drizzle kale with a touch more oil and season with a pinch each salt and pepper. Bake for another 4-5 minutes then set aside.</li>
<li>While vegetables are roasting, heat a large skillet over medium heat and add chickpeas to a mixing bowl and toss with seasonings.</li>
<li>Once hot, add 1 Tbsp oil and chickpeas and sauté, stirring frequently. If they're browning too quickly, turn down heat. If there isn't much browning going on, increase heat. I found 10 minutes total at slightly over medium heat was perfect.</li>
<li>Once the chickpeas are browned and fragrant, remove from heat and set aside.</li>
<li>Prepare sauce by adding tahini, maple syrup and lemon juice to a mixing bowl and whisking to combine. Add hot water until a pourable sauce is formed. Set aside.</li>
<li>To serve: Slice sweet potatoes into bite size pieces. Divide vegetables between 3 serving bowls and top with chickpeas + tahini sauce.</li>
<li>Best when fresh, though leftovers will keep for a few days in the fridge.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
